<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DisplayLink.</string>
    <key>Identifier</key>
    <string>com.github.bochoven.recipes.download.DisplayLink</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DisplayLink</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.displaylink.com/downloads</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
	<dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is now non-functional, check https://github.com/autopkg/dataJAR-recipes/tree/master/DisplayLink as a replacement. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
