<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Import DisplayLink Driver into munki.</string>
    <key>Identifier</key>
    <string>com.github.bochoven.recipes.munki.DisplayLink</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/%NAME%</string>
      <key>NAME</key>
      <string>displaylink</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Utilities</string>
        <key>description</key>
        <string>DisplayLink Software Installer to use with a Port Replicator. You can find the user manual &lt;a href="http://downloads.displaylink.com/manuals/DisplayLink%20Mac%20User%20Guide%20for%202.3%20software.pdf"&gt;here&lt;/a&gt;</string>
        <key>developer</key>
        <string>DisplayLink</string>
        <key>display_name</key>
        <string>DisplayLink Driver Installer</string>
        <key>minimum_os_version</key>
        <string>10.15</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.bochoven.recipes.download.DisplayLink</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>version</key>
            <string>%version%</string>
          </dict>
        </dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
