<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of DisplayLink.</string>
    <key>Identifier</key>
    <string>com.github.bochoven.recipes.download.DisplayLink</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>DisplayLink</string>
      <key>DOWNLOAD_URL</key>
      <string>https://www.displaylink.com/downloads</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>re_pattern</key>
          <string>a href=\"/downloads/file\?id=(\d+)\" title=\"Download File\" onclick=\"\" class=\"download-link\"&gt;&lt;button&gt;Download&lt;/button&gt;&lt;/a&gt;</string>
          <key>url</key>
          <string>%DOWNLOAD_URL%/macos</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>curl_opts</key>
          <array>
            <string>-F</string>
            <string>fileId=%match%</string>
            <string>-F</string>
            <string>accept_submit=Accept</string>
            <string>--location</string>
          </array>
          <key>filename</key>
          <string>%NAME%.pkg</string>
          <key>url</key>
          <string>%DOWNLOAD_URL%/file?id=%match%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/downloads/DisplayLink.pkg</string>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: DisplayLink Corp (73YQY62QM3)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/expanded</string>
          <key>flat_pkg_path</key>
          <string>%pathname%</string>
        </dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/expanded/DisplayLinkManagerApp.pkg/Payload</string>
        </dict>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/DisplayLink Manager.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
      </dict>
    </array>
  </dict>
</plist>
