<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of NoMADLogin-AD</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.download.NoMADLogin-AD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NoMAD-Login-AD</string>
		<key>URL</key>
		<string>https://files.nomad.menu/NoMAD-Login-AD.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%/*authchanger.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
	</array>
</dict>
</plist>
