<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VU-DAMS.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.download.VU-DAMS</string>
	<key>Input</key>
	<dict>
		<key>RE_PATTERN</key>
		<string>href="(http://www.vu-ams.nl/fileadmin/user_upload/software/VU-DAMS/.*.dmg)"</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(https://vu-ams.nl/wp-content/uploads/[\d/]+/VU-DAMS[\d\.]+\.dmg)"</string>
				<key>url</key>
				<string>https://vu-ams.nl/downloads/</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>VU-DAMS.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VU-DAMS.app</string>
				<key>requirement</key>
				<string>identifier "nl.vu.VUDAMS" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = L34UB8AH3J</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
