<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of MindManager for macOS and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.MindManager.munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>mindmanager</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>mindjet/mindmanager</string>
		<key>pkginfo</key>
		<dict>
				<key>catalogs</key>
				<array>
						<string>testing</string>
				</array>
				<key>category</key>
				<string>Productivity</string>
				<key>description</key>
				<string>Professional mind mapping &amp; project management tool.</string>
				<key>developer</key>
				<string>MindJet</string>
				<key>display_name</key>
				<string>Mindjet MindManager</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.MindManager</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>additional_makepkginfo_options</key>
						<array>
								<string>--destinationpath</string>
								<string>%APP_DESTINATION%</string>
						</array>
						<key>pkg_path</key>
						<string>%pathname%</string>
						<key>repo_subdirectory</key>
						<string>%MUNKI_REPO_SUBDIR%</string>
						<key>version_comparison_key</key>
						<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
