<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports SURFdrive into Munki.</string>
    <key>Identifier</key>
    <string>com.github.bochoven.recipes.munki.surfdrive</string>
    <key>Input</key>
  	<dict>
  		<key>NAME</key>
  		<string>surfdrive</string>
  		<key>MUNKI_REPO_SUBDIR</key>
  		<string>surf/surfdrive</string>
  		<key>MUNKI_CATEGORY</key>
  		<string>Productivity</string>
  		<key>pkginfo</key>
  		<dict>
  			<key>catalogs</key>
  			<array>
  				<string>testing</string>
  			</array>
  			<key>category</key>
  			<string>%MUNKI_CATEGORY%</string>
  			<key>description</key>
  			<string>With SURFdrive you can store your personal files in a safe and trusted cloud environment that is developed by SURF on behalf of the Dutch higher education and research. The data will always be stored inside the Netherlands and will never be offered or sold to third parties.</string>
  			<key>developer</key>
  			<string>Surf</string>
  			<key>display_name</key>
  			<string>SURFdrive</string>
  			<key>name</key>
  			<string>%NAME%</string>
  			<key>unattended_install</key>
  			<true/>
  		</dict>
  	</dict>
  	<key>MinimumVersion</key>
  	<string>0.2.9</string>
  	<key>ParentRecipe</key>
  	<string>com.github.bochoven.recipes.download.surfdrive</string>
  	<key>Process</key>
  	<array>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>pkg_path</key>
  				<string>%found_filename%</string>
  				<key>repo_subdirectory</key>
  				<string>%MUNKI_REPO_SUBDIR%</string>
  			</dict>
  			<key>Processor</key>
  			<string>MunkiImporter</string>
  		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_ids_set_optional_true</key>
                <array>
                    <string>com.ownCloud.finderPlugin</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>com.github.keeleysam.recipes.GoogleTalkPlugin/MunkiPkginfoReceiptsEditor</string>
        </dict>
  	</array>
  </dict>
  </plist>
