<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of PsychoPy.
	
As of December 2024, valid values for PY_VERS include:
- 3.8
- 3.10
</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.download.PsychoPy3</string>
	<key>Input</key>
	<dict>
		<key>PY_VERS</key>
		<string>3.10</string>
		<key>NAME</key>
		<string>PsychoPy3</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>psychopy/psychopy</string>
				<key>asset_regex</key>
				<string>^StandalonePsychoPy-[\d\.]+-macOS-%PY_VERS%\.dmg$</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
