<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of WebDrive.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.webdrive.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>webdrive</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://www.webdrive.com/appcasts/webdrive4.xml</string>
		<key>USER_AGENT</key>
		<string>WebDrive for Mac/4.21 Sparkle/313</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
				<key>appcast_request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
