<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ExpanDrive and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.munki.ExpanDrive</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ExpanDrive</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Access cloud storage just like a USB drive.</string>
			<key>developer</key>
			<string>ExpanDrive, Inc.</string>
			<key>display_name</key>
			<string>ExpanDrive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Copy the strongfuse.fs filesystem files per instructions by ExpandDrive
SOURCE_DIR=/Applications/ExpanDrive.app/Contents/SharedSupport/exfs.app/Contents/Resources/
TARGET_DIR=/Library/Filesystems/strongfuse.fs/Contents/Resources/
cp -r ${SOURCE_DIR}strongfuse.fs /Library/Filesystems &amp;&amp; chmod +s ${TARGET_DIR}load_strongfuse ${TARGET_DIR}mount_strongfuse
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
# Remove the strongfuse.fs filesystem files
rm -rf /Library/Filesystems/strongfuse.fs
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.bochoven.recipes.download.ExpanDrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
