<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ExpanDrive and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.munki.ExpanDrive</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ExpanDrive</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Access cloud storage just like a USB drive.</string>
			<key>developer</key>
			<string>ExpanDrive, Inc.</string>
			<key>display_name</key>
			<string>ExpanDrive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Copy the strongfuse.fs filesystem files per instructions by ExpandDrive
cp -r /Applications/ExpanDrive.app/Contents/Resources/strongfuse.fs /Library/Filesystems &amp;&amp; chmod +s /Library/Filesystems/strongfuse.fs/Contents/Resources/load_strongfuse /Library/Filesystems/strongfuse.fs/Contents/Resources/mount_strongfuse
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
# Remove the strongfuse.fs filesystem files
rm -rf /Library/Filesystems/strongfuse.fs
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.bochoven.recipes.download.ExpanDrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
