<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ADF and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.munki.ADF</string>
	<key>Input</key>
	<dict>
		<key>BASENAME</key>
		<string>ADF</string>
		<key>BASEVERSION</key>
		<string>2017</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.scm.com/support/downloads/</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>scm/adf/%BASENAME%%BASEVERSION%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Scientific Software</string>
			<key>description</key>
			<string>DFT for molecules.</string>
			<key>developer</key>
			<string>SCM</string>
			<key>display_name</key>
			<string>%BASENAME% %BASEVERSION%</string>
			<key>name</key>
			<string>%BASENAME%%BASEVERSION%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.bochoven.recipes.download.ADF</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>items_to_copy</key>
						<array>
							<dict>
								<key>source_item</key>
								<string>%app_name%</string>
								<key>destination_path</key>
								<string>/Applications</string>
								<key>destination_item</key>
								<string>%BASENAME%%BASEVERSION%.app</string>
							</dict>
						</array>
						<key>installs</key>
						<array>
							<dict>
								<key>CFBundleIdentifier</key>
								<string>%bundleid%</string>
								<key>CFBundleName</key>
								<string>SCM-ADF</string>
								<key>CFBundleShortVersionString</key>
								<string>%version%</string>
								<key>minosversion</key>
								<string>10.6</string>
								<key>path</key>
								<string>/Applications/%BASENAME%%BASEVERSION%.app</string>
								<key>type</key>
								<string>application</string>
								<key>version_comparison_key</key>
								<string>CFBundleShortVersionString</string>
							</dict>
						</array>
					</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
