<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ADF.</string>
	<key>Identifier</key>
	<string>com.github.bochoven.recipes.download.ADF</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.scm.com/support/downloads/</string>
		<key>AUTH_HASH</key>
		<string>GENERATE BASE64 AUTH HASH FROM username:password</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https:\/\/downloads.scm.com/Downloads/download%BASEVERSION%/bin/((adf|ams)%BASEVERSION%.[\d]+.macintel64.openmpi).dmg</string>
				<key>request_headers</key>
				<dict>
					<key>Authorization</key>
					<string>Basic %AUTH_HASH%</string>
				</dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%match%.dmg</string>
				<key>url</key>
				<string>https://downloads.scm.com/Downloads/download%BASEVERSION%/bin/%match%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
